; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v12 ?v10)
             (pred_9 ?v13 ?v5)
             (pred_8 ?v12 ?v5)
             (pred_3 ?v8 ?v12 )
	     (pred_2 ?v12)
             (pred_1 ?v7)
             (pred_12 ?v13)
             (pred_6 ?v5)
             (pred_5 ?v12)
             (pred_10 ?v13)
             (pred_7 ?v12)
             (pred_11 ))



(:action op_1
:parameters (?v3 ?v1 ?v2 ?v6)
:precondition (and (pred_1 ?v3) (pred_1 ?v1) (pred_12 ?v2) (pred_6 ?v6)
          (pred_4 ?v3 ?v1) (pred_9 ?v2 ?v6)
                   (pred_8 ?v1 ?v6) (pred_2 ?v3) 
                   (pred_5 ?v1) (pred_10 ?v2))
:effect (and  (pred_7 ?v1) (not (pred_5 ?v1))))


(:action op_4
:parameters (?v3 ?v4)
:precondition (and (pred_1 ?v3) (pred_1 ?v4)
               (pred_2 ?v3) (pred_4 ?v3 ?v4) (pred_7 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v3))))

(:action op_5
:parameters (?v3 ?v2)
:precondition (and (pred_1 ?v3) (pred_12 ?v2) 
                  (pred_2 ?v3) (pred_3 ?v2 ?v3) (pred_11 ))
:effect (and (pred_10 ?v2)
   (not (pred_3 ?v2 ?v3)) (not (pred_11 ))))


(:action op_2
:parameters (?v3 ?v11 ?v9)
:precondition (and (pred_1 ?v3) (pred_12 ?v11) (pred_12 ?v9)
                  (pred_2 ?v3) (pred_10 ?v9) (pred_3 ?v11 ?v3))
:effect (and (pred_10 ?v11) (pred_3 ?v9 ?v3)
        (not (pred_10 ?v9)) (not (pred_3 ?v11 ?v3))))

(:action op_3
:parameters (?v3 ?v2)
:precondition (and (pred_1 ?v3) (pred_12 ?v2) 
                  (pred_2 ?v3) (pred_10 ?v2))
:effect (and (pred_11 ) (pred_3 ?v2 ?v3) (not (pred_10 ?v2)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_18 obj_15 obj_01 obj_03 obj_13 obj_09 obj_17 obj_21 obj_11 obj_10 obj_08 obj_22 obj_02 obj_23 obj_26 obj_20 obj_14 obj_12 obj_19 obj_06 obj_28 obj_27 obj_24 obj_30
    obj_04 obj_05
    obj_07 obj_29 obj_25
    )

    (:init
       (pred_11)

       (pred_1 obj_16)
       (pred_1 obj_18)
       (pred_1 obj_15)
       (pred_1 obj_01)
       (pred_1 obj_03)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_17)
       (pred_1 obj_21)
       (pred_1 obj_11)
       (pred_1 obj_10)
       (pred_1 obj_08)
       (pred_1 obj_22)
       (pred_1 obj_02)
       (pred_1 obj_23)
       (pred_1 obj_26)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_06)
       (pred_1 obj_28)
       (pred_1 obj_27)
       (pred_1 obj_24)
       (pred_1 obj_30)
       (pred_6 obj_04)
       (pred_6 obj_05)
       (pred_12 obj_07)
       (pred_12 obj_29)
       (pred_12 obj_25)

       (pred_4 obj_16 obj_13)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_15 obj_01)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_01 obj_21)
       (pred_4 obj_01 obj_03)
       (pred_4 obj_01 obj_15)
       (pred_4 obj_03 obj_11)
       (pred_4 obj_03 obj_01)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_16)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_17 obj_22)
       (pred_4 obj_17 obj_21)
       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_21 obj_02)
       (pred_4 obj_21 obj_11)
       (pred_4 obj_21 obj_01)
       (pred_4 obj_21 obj_17)
       (pred_4 obj_11 obj_23)
       (pred_4 obj_11 obj_03)
       (pred_4 obj_11 obj_21)
       (pred_4 obj_10 obj_26)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_22)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_22 obj_14)
       (pred_4 obj_22 obj_02)
       (pred_4 obj_22 obj_17)
       (pred_4 obj_22 obj_08)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_23)
       (pred_4 obj_02 obj_21)
       (pred_4 obj_02 obj_22)
       (pred_4 obj_23 obj_19)
       (pred_4 obj_23 obj_11)
       (pred_4 obj_23 obj_02)
       (pred_4 obj_26 obj_06)
       (pred_4 obj_26 obj_20)
       (pred_4 obj_26 obj_10)
       (pred_4 obj_20 obj_28)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_26)
       (pred_4 obj_14 obj_27)
       (pred_4 obj_14 obj_12)
       (pred_4 obj_14 obj_22)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_12 obj_24)
       (pred_4 obj_12 obj_19)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_14)
       (pred_4 obj_19 obj_30)
       (pred_4 obj_19 obj_23)
       (pred_4 obj_19 obj_12)
       (pred_4 obj_06 obj_28)
       (pred_4 obj_06 obj_26)
       (pred_4 obj_28 obj_27)
       (pred_4 obj_28 obj_20)
       (pred_4 obj_28 obj_06)
       (pred_4 obj_27 obj_24)
       (pred_4 obj_27 obj_14)
       (pred_4 obj_27 obj_28)
       (pred_4 obj_24 obj_30)
       (pred_4 obj_24 obj_12)
       (pred_4 obj_24 obj_27)
       (pred_4 obj_30 obj_19)
       (pred_4 obj_30 obj_24)
       (pred_5 obj_11)
       (pred_5 obj_23)
       (pred_5 obj_17)
       (pred_8  obj_11 obj_04)
       (pred_8  obj_23 obj_05)
       (pred_8  obj_17 obj_04)
       (pred_7 obj_16)
       (pred_7 obj_18)
       (pred_7 obj_15)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_09)
       (pred_7 obj_21)
       (pred_7 obj_10)
       (pred_7 obj_08)
       (pred_7 obj_22)
       (pred_7 obj_02)
       (pred_7 obj_26)
       (pred_7 obj_20)
       (pred_7 obj_14)
       (pred_7 obj_12)
       (pred_7 obj_19)
       (pred_7 obj_06)
       (pred_7 obj_28)
       (pred_7 obj_27)
       (pred_7 obj_24)
       (pred_7 obj_30)

       (pred_9  obj_07 obj_04)
       (pred_9  obj_29 obj_05)
       (pred_9  obj_25 obj_05)
       (pred_3 obj_07 obj_30)
       (pred_3 obj_29 obj_18)
       (pred_3 obj_25 obj_13)
       (pred_2 obj_18)
    )

    (:goal (and
       (pred_3 obj_07 obj_15)
       (pred_3 obj_25 obj_16)
    ))
(:constraints
  (always (not (pred_2 obj_12)))
)
)

; plan
1. (op_5 obj_18 obj_29)
   deleted: (pred_3 obj_29 obj_18) (pred_11)
   added: (pred_10 obj_29)
   goals met: 0 of 2
2. (op_4 obj_18 obj_15)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_15)
   goals met: 0 of 2
3. (op_3 obj_15 obj_29)
   deleted: (pred_10 obj_29)
   added: (pred_11) (pred_3 obj_29 obj_15)
   goals met: 0 of 2
4. (op_4 obj_15 obj_18)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_18)
   goals met: 0 of 2
5. (op_4 obj_18 obj_16)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_16)
   goals met: 0 of 2
6. (op_4 obj_16 obj_13)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_13)
   goals met: 0 of 2
7. (op_5 obj_13 obj_25)
   deleted: (pred_3 obj_25 obj_13) (pred_11)
   added: (pred_10 obj_25)
   goals met: 0 of 2
8. (op_4 obj_13 obj_16)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_16)
   goals met: 0 of 2
9. (op_3 obj_16 obj_25)
   deleted: (pred_10 obj_25)
   added: (pred_11) (pred_3 obj_25 obj_16)
   goals met: 1 of 2
10. (op_4 obj_16 obj_18)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_18)
   goals met: 1 of 2
11. (op_4 obj_18 obj_09)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_09)
   goals met: 1 of 2
12. (op_4 obj_09 obj_08)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_08)
   goals met: 1 of 2
13. (op_4 obj_08 obj_20)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_20)
   goals met: 1 of 2
14. (op_4 obj_20 obj_14)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_14)
   goals met: 1 of 2
15. (op_4 obj_14 obj_27)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_27)
   goals met: 1 of 2
16. (op_4 obj_27 obj_24)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_24)
   goals met: 1 of 2
17. (op_4 obj_24 obj_30)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_30)
   goals met: 1 of 2
18. (op_5 obj_30 obj_07)
   deleted: (pred_3 obj_07 obj_30) (pred_11)
   added: (pred_10 obj_07)
   goals met: 1 of 2
19. (op_4 obj_30 obj_24)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_24)
   goals met: 1 of 2
20. (op_4 obj_24 obj_27)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_27)
   goals met: 1 of 2
21. (op_4 obj_27 obj_14)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_14)
   goals met: 1 of 2
22. (op_4 obj_14 obj_22)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_22)
   goals met: 1 of 2
23. (op_1 obj_22 obj_17 obj_07 obj_04)
   deleted: (pred_5 obj_17)
   added: (pred_7 obj_17)
   goals met: 1 of 2
24. (op_4 obj_22 obj_17)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_17)
   goals met: 1 of 2
25. (op_4 obj_17 obj_15)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_15)
   goals met: 1 of 2
26. (op_2 obj_15 obj_29 obj_07)
   deleted: (pred_10 obj_07) (pred_3 obj_29 obj_15)
   added: (pred_10 obj_29) (pred_3 obj_07 obj_15)
   goals met: 2 of 2
